#Область СлужебныеПроцедурыИФункции	

Функция ПечатьСертификатаКачестваВОфисномДокументе(ПараметрыПечати) Экспорт
		   
	ИмяМенеджераПечати = ПараметрыПечати.МенеджерПечати;
	ИмяМакета = ПараметрыПечати.Идентификатор;
	СоставДокументов = ПараметрыПечати.ОбъектыПечати;
//	ФормаИсточник = ПараметрыПечати.Форма;
	
	ТекстСообщения = ?(СоставДокументов.Количество() > 1, 
	НСтр("ru = 'Выполняется формирование печатных форм...'"),
	НСтр("ru = 'Выполняется формирование печатной формы...'"));
	Состояние(ТекстСообщения);
	
	МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати(ИмяМенеджераПечати, ИмяМакета, СоставДокументов);
	
	Для Каждого ДокументСсылка Из СоставДокументов Цикл
		ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
		ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
		Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
		ДанныеОбъекта = МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета]; 
			
		//@skip-check object-deprecated
		Макет = УправлениеПечатьюКлиент.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
		Если Макет = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗакрытьОкноПечатнойФормы = Ложь;
		Попытка
			ПечатнаяФорма = УправлениеПечатьюКлиент.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
			Если ПечатнаяФорма = Неопределено Тогда
				//@skip-check object-deprecated
				УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
				Продолжить;
			КонецЕсли;
			
			//// Вывод колонтитулов документа.
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ВерхнийКолонтитул"]);
			//@skip-check object-deprecated
			УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["НижнийКолонтитул"]);
			//@skip-check object-deprecated
			УправлениеПечатьюКлиент.ПрисоединитьОбласть(ПечатнаяФорма, Область);
						//
			//// Вывод верхней части документа - обычная область с параметрами.
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["Заголовок"]);
			//@skip-check object-deprecated
			УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			//   
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["Абзац"]);
			//@skip-check object-deprecated
			УправлениеПечатьюКлиент.ПрисоединитьОбласть(ПечатнаяФорма, Область);

			
			
			УправлениеПечатьюКлиент.ПоказатьДокумент(ПечатнаяФорма);
		Исключение
			//@skip-check object-deprecated
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗакрытьОкноПечатнойФормы = Истина;
			Продолжить;
		КонецПопытки;
		
		//@skip-check object-deprecated
		УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
		//@skip-check object-deprecated
		УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
			
	КонецЦикла;
	Возврат Истина;		
КонецФункции

#КонецОбласти
