#Область СлужебныеПроцедурыИФункции	
Функция СформироватьСтруктуру(ТекущиеДанные) Экспорт
	
	СтруктураТекДанных = Новый Структура;
	СтруктураТекДанных.Вставить("PID", ТекущиеДанные.PID); 
	СтруктураТекДанных.Вставить("ВидСертификата", ТекущиеДанные.ВидСертификата);
	СтруктураТекДанных.Вставить("ВесБрутто", ТекущиеДанные.ВесБрутто); 
	СтруктураТекДанных.Вставить("ВесНетто", ТекущиеДанные.ВесНетто); 
	СтруктураТекДанных.Вставить("Гост", ТекущиеДанные.Гост); 
	СтруктураТекДанных.Вставить("Количество", ТекущиеДанные.Количество);                             
	СтруктураТекДанных.Вставить("КоличествоСтрокой", ТекущиеДанные.КоличествоСтрокой); 
	СтруктураТекДанных.Вставить("Марка", ТекущиеДанные.Марка); 
	СтруктураТекДанных.Вставить("НомерБарабана", ТекущиеДанные.НомерБарабана); 
	СтруктураТекДанных.Вставить("НомерЗаявки", ТекущиеДанные.НомерЗаявки); 
	СтруктураТекДанных.Вставить("НомерИспытания", ТекущиеДанные.НомерИспытания); 
	СтруктураТекДанных.Вставить("Обшив", ТекущиеДанные.Обшив);                       
	СтруктураТекДанных.Вставить("Отрезок", ТекущиеДанные.Отрезок);
	СтруктураТекДанных.Вставить("Размер", ТекущиеДанные.Размер); 
	СтруктураТекДанных.Вставить("РезультатИспытанияЖилаОсновная", ТекущиеДанные.РезультатИспытанияЖилаОсновная);
	СтруктураТекДанных.Вставить("РезультатИспытанияЖилаКоричневая", ТекущиеДанные.РезультатИспытанияЖилаКоричневая);
	СтруктураТекДанных.Вставить("РучноеРедактированиеРазмерКабеляИОтрезок", ТекущиеДанные.РучноеРедактированиеРазмерКабеляИОтрезок); 
	СтруктураТекДанных.Вставить("РучноеРедактированиеКоличествоСтрокой", ТекущиеДанные.РучноеРедактированиеКоличествоСтрокой);
    СтруктураТекДанных.Вставить("РезультатИспытанияЖилаКоричневая", ТекущиеДанные.РезультатИспытанияЖилаКоричневая);
	СтруктураТекДанных.Вставить("РезультатИспытанияЖилаЧерная", ТекущиеДанные.РезультатИспытанияЖилаЧерная);
	СтруктураТекДанных.Вставить("РезультатИспытанияЖилаСиняя", ТекущиеДанные.РезультатИспытанияЖилаСиняя); 
	СтруктураТекДанных.Вставить("РезультатИспытанияЖилаЗаземления", ТекущиеДанные.РезультатИспытанияЖилаЗаземления);
	СтруктураТекДанных.Вставить("РезультатИспытанияИзоляцииЖилаОсновная", ТекущиеДанные.РезультатИспытанияИзоляцииЖилаОсновная);
	СтруктураТекДанных.Вставить("РезультатИспытанияИзоляцииЖилаКоричневая", ТекущиеДанные.РезультатИспытанияИзоляцииЖилаКоричневая);
	СтруктураТекДанных.Вставить("РезультатИспытанияИзоляцииЖилаЧерная", ТекущиеДанные.РезультатИспытанияИзоляцииЖилаЧерная);
	СтруктураТекДанных.Вставить("РезультатИспытанияИзоляцииЖилаСиняя", ТекущиеДанные.РезультатИспытанияИзоляцииЖилаСиняя); 
	СтруктураТекДанных.Вставить("РезультатИспытанияИзоляцииЖилаЗаземления", ТекущиеДанные.РезультатИспытанияИзоляцииЖилаЗаземления); 
	СтруктураТекДанных.Вставить("ТребуемоеЗначениеЖилаОсновная", ТекущиеДанные.ТребуемоеЗначениеЖилаОсновная);
	СтруктураТекДанных.Вставить("ТребуемоеЗначениеЖилаКоричневая", ТекущиеДанные.ТребуемоеЗначениеЖилаКоричневая);  
	СтруктураТекДанных.Вставить("ТребуемоеЗначениеЖилаЧерная", ТекущиеДанные.ТребуемоеЗначениеЖилаЧерная); 
	СтруктураТекДанных.Вставить("ТребуемоеЗначениеЖилаСиняя", ТекущиеДанные.ТребуемоеЗначениеЖилаСиняя);
	СтруктураТекДанных.Вставить("ТребуемоеЗначениеЖилаЗаземления", ТекущиеДанные.ТребуемоеЗначениеЖилаЗаземления);
	СтруктураТекДанных.Вставить("ТребуемоеЗначениеИзоляцииЖилаОсновная", ТекущиеДанные.ТребуемоеЗначениеИзоляцииЖилаОсновная);
	СтруктураТекДанных.Вставить("ТребуемоеЗначениеИзоляцииЖилаКоричневая", ТекущиеДанные.ТребуемоеЗначениеИзоляцииЖилаКоричневая);
	СтруктураТекДанных.Вставить("ТребуемоеЗначениеИзоляцииЖилаЧерная", ТекущиеДанные.ТребуемоеЗначениеИзоляцииЖилаЧерная);
	СтруктураТекДанных.Вставить("ТребуемоеЗначениеИзоляцииЖилаСиняя", ТекущиеДанные.ТребуемоеЗначениеИзоляцииЖилаСиняя);
	СтруктураТекДанных.Вставить("ТребуемоеЗначениеИзоляцииЖилаЗаземления", ТекущиеДанные.ТребуемоеЗначениеИзоляцииЖилаЗаземления);
	СтруктураТекДанных.Вставить("Тара", ТекущиеДанные.Тара); 
	СтруктураТекДанных.Вставить("ШтампОТК", ТекущиеДанные.ШтампОТК); 
	СтруктураТекДанных.Вставить("ЦветКабеля", ТекущиеДанные.ЦветКабеля);
	СтруктураТекДанных.Вставить("МаркаНапряжение", ТекущиеДанные.МаркаНапряжение);
	СтруктураТекДанных.Вставить("Напряжение", ТекущиеДанные.МаркаНапряжение);
	СтруктураТекДанных.Вставить("ПризнакРучныеИзмененияТребуемыхЗначений", ТекущиеДанные.ПризнакРучныеИзмененияТребуемыхЗначений); 
	СтруктураТекДанных.Вставить("ВидСертификата", ТекущиеДанные.ВидСертификата);	
	Возврат СтруктураТекДанных;
	
КонецФункции
#КонецОбласти
