#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗакрыватьПриВыборе = Истина;
	//ЗапрашиватьКоличество = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Асинх Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные =  Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные.ЭтоГруппа   тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	
	ВыбратьКабель(1);
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура СписокВыборЗавершение(Число, ДополнительныеПараметры) Экспорт
	Если Число<>Неопределено и Число<>0  Тогда
	ВыбратьКабель(Число);
	
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКабель(Количество)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("Марка",ТекущиеДанные.Ссылка);
	СтруктураВыбора.Вставить("Размер", ТекущиеДанные.Размер);
	СтруктураВыбора.Вставить("Количество", Количество);
	СтруктураВыбора.Вставить("Вес", ТекущиеДанные.Вес);

	ОповеститьОВыборе(СтруктураВыбора);
	
КонецПроцедуры // ВыбратьКабель()
#КонецОбласти

