
&НаСервере
Функция  ВыполнитьЗаменуНаСервере()
		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбъектДокумент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Для Каждого Стр из ОбъектДокумент.СписокКабелей Цикл 
			Если Стр.Тара.Наименование = "Бухта" Тогда 
				Стр.Тара = Справочники.Тара.Бухта;
			КонецЕсли;
		КонецЦикла;
		ОбъектДокумент.Записать();
	КонецЦикла;
	
	Возврат ОбъектДокумент.Ссылка;
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗамену(Команда) 
	
	ПоказатьПредупреждение(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект), "Будет произведена замена ссылок на предопределенный элемент   справочника Тара, Бухта
					|Выполнение можно прервать, нажав сочетание клавиш Ctrl + Break",
					,
					"Добавление товаров");

	
КонецПроцедуры    

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(ДополнительныеПараметры) Экспорт
	
	Для Счетчик = 0 по 9 Цикл
		
		ПоследняяДобавленнаяСсылка = ВыполнитьЗаменуНаСервере();
		Состояние("замена  ссылок в документах",
		10 + Счетчик * 10,
		"Выполнятеся  замена ссылок в документах",
		БиблиотекаКартинок.Заменить);
		
		ОбработкаПрерыванияПользователя();		  
		
	КонецЦикла;
	
	
	// Обновить список товаров на начальной странице
	ОповеститьОбИзменении(ПоследняяДобавленнаяСсылка);
	
	ПоказатьОповещениеПользователя("Данные заполнены",
	ПолучитьНавигационнуюСсылку(ПоследняяДобавленнаяСсылка),
	"Открыть последний документ  с замещаемой ссылкой",
	БиблиотекаКартинок.Документ, СтатусОповещенияПользователя.Важное);

КонецПроцедуры


