#Область СлужебныеПроцедурыИФункции	
Процедура УстановитьУсловноеоформлениеФормы(Форма, Поле) Экспорт
	
	Элемент = Форма.УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Поле);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СписокКабелей[Поле]");
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыпускаемаяПродукция.Тара");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
	ОтборЭлемента.ПравоеЗначение = Поле; 
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет);
	
КонецПроцедуры
#КонецОбласти