#Область СлужебныеПроцедурыИФункции	
Функция  ПолучитьТекстЗапроса(ЭтоЗапросДляБирки) Экспорт
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВыпускПродукции.СписокКабелей.(
	|		Марка КАК Марка,
	|		ЦветКабеля КАК ЦветКабеля,
	|		НомерЗаявки КАК НомерЗаявки,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		НомерСтроки КАК НомерСтроки,
	|		Гост КАК Гост,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Артикул КАК Артикул,
	|		НомерИспытания КАК НомерИспытания,
	|		ШтампОТК КАК ШтампОТК,
	|		Тара КАК Тара,
	|		Марка.Напряжение КАК Напряжение,
	|		Обшив КАК Обшив,
	|		ВесБрутто КАК ВесБрутто,
	|		ВесНетто КАК ВесНетто,
	|		РассчитываемоеКоличествоБухт КАК РассчитываемоеКоличествоБухт,
	|		Размер КАК Размер,
	|		РучноеРедактированиеРазмерКабеляИОтрезок КАК РучноеРедактированиеРазмерКабеляИОтрезок,
	|		РучноеРедактированиеКоличествоСтрокой КАК РучноеРедактированиеКоличествоСтрокой,
	|		КоличествоСтрокой КАК КоличествоСтрокой,
	|		Отрезок КАК Отрезок,
	|		Марка.Напряжение КАК МаркаНапряжение,
	|		PID КАК PID,
	|		ПризнакРучныеИзмененияТребуемыхЗначений КАК ПризнакРучныеИзмененияТребуемыхЗначений,
	|		РезультатИспытанияЖилаОсновная КАК РезультатИспытанияЖилаОсновная,
	|		РезультатИспытанияЖилаКоричневая КАК РезультатИспытанияЖилаКоричневая,
	|		РезультатИспытанияЖилаЧерная КАК РезультатИспытанияЖилаЧерная,
	|		РезультатИспытанияЖилаСиняя КАК РезультатИспытанияЖилаСиняя,
	|		РезультатИспытанияЖилаЗаземления КАК РезультатИспытанияЖилаЗаземления,
	|		РезультатИспытанияИзоляцииЖилаОсновная КАК РезультатИспытанияИзоляцииЖилаОсновная,
	|		РезультатИспытанияИзоляцииЖилаКоричневая КАК РезультатИспытанияИзоляцииЖилаКоричневая,
	|		РезультатИспытанияИзоляцииЖилаЧерная КАК РезультатИспытанияИзоляцииЖилаЧерная,
	|		РезультатИспытанияИзоляцииЖилаСиняя КАК РезультатИспытанияИзоляцииЖилаСиняя,
	|		РезультатИспытанияИзоляцииЖилаЗаземления КАК РезультатИспытанияИзоляцииЖилаЗаземления,
	|		МаркаНапряжение КАК МаркаНапряжение1,
	|		ТребуемоеЗначениеЖилаОсновная КАК ТребуемоеЗначениеЖилаОсновная,
	|		ТребуемоеЗначениеЖилаКоричневая КАК ТребуемоеЗначениеЖилаКоричневая,
	|		ТребуемоеЗначениеЖилаЧерная КАК ТребуемоеЗначениеЖилаЧерная,
	|		ТребуемоеЗначениеЖилаСиняя КАК ТребуемоеЗначениеЖилаСиняя,
	|		ТребуемоеЗначениеЖилаЗаземления КАК ТребуемоеЗначениеЖилаЗаземления,
	|		ТребуемоеЗначениеИзоляцииЖилаОсновная КАК ТребуемоеЗначениеИзоляцииЖилаОсновная,
	|		ТребуемоеЗначениеИзоляцииЖилаКоричневая КАК ТребуемоеЗначениеИзоляцииЖилаКоричневая,
	|		ТребуемоеЗначениеИзоляцииЖилаЧерная КАК ТребуемоеЗначениеИзоляцииЖилаЧерная,
	|		ТребуемоеЗначениеИзоляцииЖилаСиняя КАК ТребуемоеЗначениеИзоляцииЖилаСиняя,
	|		ТребуемоеЗначениеИзоляцииЖилаЗаземления КАК ТребуемоеЗначениеИзоляцииЖилаЗаземления
	|	) КАК СписокКабелей,
	|	ВыпускПродукции.Номер КАК Номер,
	|	ВыпускПродукции.Дата КАК Дата,
	|	ВыпускПродукции.Адресат КАК Адресат,
	|	ВыпускПродукции.Ссылка КАК Ссылка,
	|	1 КАК СтрокаЗапросаБирок
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Марка,
	|	Размер";
	
	Если  ЭтоЗапросДляБирки тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1 КАК СтрокаЗапросаБирок","ВЫБОР
		|КОГДА ВыпускПродукции.СписокКабелей.РучноеРедактированиеКоличествоСтрокой
		|	ТОГДА """"
		|КОГДА ВыпускПродукции.СписокКабелей.РучноеРедактированиеРазмерКабеляИОтрезок
		|	ТОГДА ВыпускПродукции.СписокКабелей.ВесНетто
		|ИНАЧЕ ВыпускПродукции.СписокКабелей.Вес
		|КОНЕЦ КАК ВесНетто");     //рефакторинг 01-05-2023
		
		КонецЕсли;                           
	    		
	Возврат ТекстЗапроса; 

КонецФункции

	
	
Функция  ПолучитьТаблицуТара(ИмяЭлемента,МассивОбъектов) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВыпускПродукцииСписокКабелей.Ссылка) КАК Количество,
	|	АВТОНОМЕРЗАПИСИ() КАК Номер,
	|	ВыпускПродукцииСписокКабелей.Тара.Наименование КАК ТараНаименование
	|ПОМЕСТИТЬ ВТТараОбшив
	|{ВЫБРАТЬ
	|	Количество.*}
	|ИЗ
	|	Документ.ВыпускПродукции.СписокКабелей КАК ВыпускПродукцииСписокКабелей
	|ГДЕ
	|	ВыпускПродукцииСписокКабелей.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыпускПродукцииСписокКабелей.Тара.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТараОбшив.Количество КАК Количество,
	|	ВТТараОбшив.ТараНаименование КАК Наименование
	|ИЗ
	|	ВТТараОбшив КАК ВТТараОбшив
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	  	
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Если ИмяЭлемента<>"Тара" тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Тара",ИмяЭлемента);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Иначе
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
		
		
		Возврат РезультатЗапроса;
КонецФункции
#КонецОбласти



