
&НаКлиенте
Процедура ГруппироватьПоДате(Команда)
	ГруппироватьСписок();
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ГруппироватьСписок();
КонецПроцедуры   

&НаКлиенте
Процедура ГруппироватьСписок()
	
	Группировки = Список.КомпоновщикНастроек.Настройки.Структура;
	ПолеДата = Новый ПолеКомпоновкиДанных("Дата");
	ГруппировкаПоДате = Неопределено;
	Для каждого ГруппировкаСписка из Группировки Цикл
		Если ТипЗнч(ГруппировкаСписка) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			Для каждого ПолеГруппировки из ГруппировкаСписка.поляГруппировки.Элементы Цикл
				Если ТипЗнч(ПолеГруппировки) = Тип("ПолеГруппировкиКомпоновкиДанных") и
					ПолеГруппировки.Поле = ПолеДата Тогда
					ГруппировкаПоДате = ГруппировкаСписка;
									
					Прервать;
				КонецЕсли;
				
				
			КонецЦикла;
		КонецЕсли	
	КонецЦикла;
	
	
	Если ГруппировкаПоДате = Неопределено тогда
		Группировки.Очистить();
		ГруппировкаПоДате = Группировки.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ПолеГруппировки   = ГруппировкаПоДате.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = ПолеДата;
		Элементы.ГруппироватьПоДате.Пометка = Истина;
		
		
	Иначе
		Группировки.Очистить();
		Элементы.ГруппироватьПоДате.Пометка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
