Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("Размер");
	Поля.Добавить("Напряжение");  
	

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.Размер) и ЗначениеЗаполнено(Данные.Напряжение) Тогда	
	ПредставлениеКабеля = " " + Строка(Данные.размер) + " "+Строка(Данные.Напряжение);
		Представление = Данные.Наименование + ПредставлениеКабеля; 
		
	ИначеЕсли ЗначениеЗаполнено(Данные.Размер) тогда
		
		Представление = Данные.Наименование +" "+Строка(Данные.размер);
		
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;	

КонецПроцедуры