
&НаКлиенте
Процедура ОК(Команда) 
	СтруктураДанныхИспытания = Новый Структура;
	
	СтруктураДанныхИспытания.Вставить("ТребуемоеЗначениеЖилаОсновная", ЭтаФорма.ТребуемоеЗначениеИспытанияЖилы); 
	СтруктураДанныхИспытания.Вставить("ТребуемоеЗначениеЖилаКоричневая", ЭтаФорма.ТребуемоеЗначениеИспытанияЖилы); 
	СтруктураДанныхИспытания.Вставить("ТребуемоеЗначениеЖилаЧерная",ЭтаФорма.ТребуемоеЗначениеИспытанияЖилы);
	СтруктураДанныхИспытания.Вставить("ТребуемоеЗначениеЖилаСиняя", ЭтаФорма.ТребуемоеЗначениеИспытанияЖилы);
	СтруктураДанныхИспытания.Вставить("ТребуемоеЗначениеЖилаЗаземления", ЭтаФорма.ТребуемоеЗначениеИспытанияЖилы);
	СтруктураДанныхИспытания.Вставить("ТребуемоеЗначениеИзоляцииЖилаОсновная", ЭтаФорма.ТребуемоеЗначениеИспытанияИзоляции); 
	СтруктураДанныхИспытания.Вставить("ТребуемоеЗначениеИзоляцииЖилаКоричневая", ЭтаФорма.ТребуемоеЗначениеИспытанияИзоляции); 
	СтруктураДанныхИспытания.Вставить("ТребуемоеЗначениеИзоляцииЖилаЧерная", ЭтаФорма.ТребуемоеЗначениеИспытанияИзоляции);
	СтруктураДанныхИспытания.Вставить("ТребуемоеЗначениеИзоляцииЖилаСиняя", ЭтаФорма.ТребуемоеЗначениеИспытанияИзоляции);
	СтруктураДанныхИспытания.Вставить("ТребуемоеЗначениеИзоляцииЖилаЗаземления", ЭтаФорма.ТребуемоеЗначениеИспытанияИзоляции);
	Если ОтключитьРучныеИсправления Тогда  
		СтруктураДанныхИспытания.Вставить("ОтключитьРучныеИсправления", Истина);
	Иначе 
		СтруктураДанныхИспытания.Вставить("ОтключитьРучныеИсправления", Ложь);
	КонецЕсли;

	
	ОповеститьОВыборе(СтруктураДанныхИспытания); 
	
  
КонецПроцедуры  


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	 
	 ТребуемоеЗначениеИспытанияЖилы    = Параметры.ТребуемоеЗначениеИспытанияЖилы;
	  ТребуемоеЗначениеИспытанияИзоляции    = Параметры.ТребуемоеЗначениеИпытанияИзоляции;
	КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьОкно(Команда)
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ОтключитьРучныеИсправленияПриИзменении(Элемент)
	ТребуемоеЗначениеИспытанияИзоляции = 0;
	ТребуемоеЗначениеИспытанияЖилы    = 0;
КонецПроцедуры

